In [1]:
import numpy as np
import pandas as pd

In [5]:
dict1 = {
    "Name":['Aman', 'Ankit', 'Naveen', 'Suheb'],
    "Marks":[99, 80, 89,70],
    "City":['Bihar', 'Patna', 'shimla','kondali' ]
}

In [6]:
df = pd.DataFrame(dict1)

In [7]:
df

     Name  Marks     City
0    Aman     99    Bihar
1   Ankit     80    Patna
2  Naveen     89   shimla
3   Suheb     70  kondali

In [8]:
df.to_csv('Sheet.csv')

In [9]:
df.to_csv('Sheet_index_false.csv', index=False)

In [10]:
df.head

<bound method NDFrame.head of      Name  Marks     City
0    Aman     99    Bihar
1   Ankit     80    Patna
2  Naveen     89   shimla
3   Suheb     70  kondali>

In [11]:
df.head(2)

    Name  Marks   City
0   Aman     99  Bihar
1  Ankit     80  Patna

In [12]:
df.describe()

           Marks
count   4.000000
mean   84.500000
std    12.396236
min    70.000000
25%    77.500000
50%    84.500000
75%    91.500000
max    99.000000